ProgessBase/Documents/ДС_РекласификацияРасходовОСМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ДС_РекласификацияРасходовОСМСФО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыМеждународныйУчет</xr:Item>
				<xr:Item>InformationRegister.ОсновныеСредстваМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводствоМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реклассификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаОС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоВзаиморасчетов1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоВзаиморасчетов2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоВзаиморасчетов3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ис_ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ис_ВалютнаяСуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ОсновныеСредстваМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСредстваМеждународныйУчет</Name>
			<Comment>(Упр) Сведения об объектах ОС  для целей международного учета</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, на балансе которой учитывется объект ОС в международном учете</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Comment>Дата принятия объекта к международному учету</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОбъекта</Name>
					<Comment>Подразделение организации, в котором находится объект ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Comment>Счет учета в плане счетов Международный</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Comment>Срок полезного использования в месяцах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Comment>Булево - начиляется амортизация или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации по международному учету</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизацииОСМеждународный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Comment>Счет, на котором накапливается начисленная амортизация</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная (историческая) стоимость объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СправедливаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Comment>Стоимость, которая должна остаться после истечения срока полезного использования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>Счет учета, в дебет которого относятся амортизационные отчисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Comment>Субконто первого уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Comment>Субконто второго уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Comment>Субконто третьего уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредполагаемыйОбъемПродукции</Name>
					<Comment>Используется при амортизации пропорционально объему продукции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНачисленнойАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытокОтОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСниженияСтоимости</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ис_Лизинг</Name>
					<Comment>ОС находится в лизинге</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/НезавершенноеПроизводствоМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>НезавершенноеПроизводствоМеждународныйУчет</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийНезавершенноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПередела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.СпособыРаспределенияЗатратНаВыпуск</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаЗатраты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияЗатраты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Documents/ДС_РекласификацияРасходовОСМСФО/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если Ответственный.Пустая() Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		 
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Движения.ОсновныеСредстваМеждународныйУчет.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Срез.ОсновноеСредство,
	|	Срез.Организация,
	|	Срез.ДатаПринятияКУчету,
	|	Срез.МестонахождениеОбъекта,
	|	Срез.МОЛ,
	|	Срез.Состояние,
	|	Срез.СчетУчета,
	|	Срез.СрокПолезногоИспользования,
	|	Срез.НачислятьАмортизацию,
	|	Срез.МетодНачисленияАмортизации,
	|	Срез.СчетНачисленияАмортизации,
	|	Срез.ПервоначальнаяСтоимость + Реклассификация.СуммаЗатрат КАК ПервоначальнаяСтоимость,
	|	Срез.СправедливаяСтоимость,
	|	Срез.ЛиквидационнаяСтоимость,
	|	Срез.СчетЗатрат,
	|	Срез.Субконто1,
	|	Срез.Субконто2,
	|	Срез.Субконто3,
	|	Срез.ПредполагаемыйОбъемПродукции,
	|	Срез.СуммаНачисленнойАмортизации,
	|	Срез.УбытокОтОбесценения,
	|	Срез.КоэффициентУскорения,
	|	Срез.СчетСниженияСтоимости,
	|	Срез.ис_Лизинг,
	|	Реклассификация.ОсновноеСредство КАК ОС,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ДС_РекласификацияРасходовОСМСФО.Реклассификация КАК Реклассификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Дата, ) КАК Срез
	|		ПО Реклассификация.ОсновноеСредство = Срез.ОсновноеСредство
	|ГДЕ
	|	Реклассификация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновноеСредство = NULL Тогда
			Сообщить("По основному средству [" + Выборка.ОС + "] нет данных в регистре ""Основные средства (международный учет)""!", СтатусСообщения.Внимание);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Движения.ОсновныеСредстваМеждународныйУчет.Загрузить(Результат.Выгрузить());
	
	// is ЯннуровВФ нач 20140611 ЗР-0И-001232
	Движения.НезавершенноеПроизводствоМеждународныйУчет.Записывать = Истина;
	Движения.ЗатратыМеждународныйУчет.Записывать = Истина;
	// is ЯннуровВФ кон 20140611
	
	Движения.Международный.Записывать = Истина;
	Движения.Международный.Очистить();
	Для Каждого ТекСтрокаРеклассификация Из Реклассификация Цикл
		
		// is ЯннуровВФ нач 20140611 ЗР-0И-001232
		лПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		лНоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
		лСтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Для лНомер=1 По 3 Цикл 
			лЗначениеСубконто = ТекСтрокаРеклассификация["СубконтоЗатрат"+лНомер];
			Если ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
				лПодразделение = лЗначениеСубконто;
			ИначеЕсли ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда 
				лНоменклатурнаяГруппа = лЗначениеСубконто;
			ИначеЕсли ТипЗнч(лЗначениеСубконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда 
				лСтатьяЗатрат = лЗначениеСубконто;
			КонецЕсли;
		КонецЦикла;
		
		лРегистрЗатрат = ис_Международный.ПолучитьРегистрПоСчетуЗатрат(ТекСтрокаРеклассификация.СчетЗатрат);
		Если лРегистрЗатрат = "НезавершенноеПроизводствоМеждународныйУчет" Тогда 
			лДвижение = Движения.НезавершенноеПроизводствоМеждународныйУчет.Добавить();
			лДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			лДвижение.Период = Дата;
			лДвижение.Организация = Организация;
			лДвижение.Подразделение = лПодразделение;
			лДвижение.СчетУчета = ТекСтрокаРеклассификация.СчетЗатрат;
			лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
			лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
			лДвижение.Заказ = Неопределено;
			лДвижение.Затрата = Неопределено;
			лДвижение.ХарактеристикаЗатраты = Неопределено;
			лДвижение.СерияЗатраты = Неопределено;
			лДвижение.Количество = 0;
			лДвижение.Стоимость = -ТекСтрокаРеклассификация.СуммаЗатрат; 
			лДвижение.КодОперации = Перечисления.КодыОперацийНезавершенноеПроизводство.ПустаяСсылка();
			лДвижение.СписаниеПартий = Ложь;
			лДвижение.НомерПередела = 0
		ИначеЕсли лРегистрЗатрат = "ЗатратыМеждународныйУчет" Тогда 
			лДвижение = Движения.ЗатратыМеждународныйУчет.Добавить();
			лДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			лДвижение.Период = Дата;
			лДвижение.Организация = Организация;
			лДвижение.Подразделение = лПодразделение;
			лДвижение.СчетУчета = ТекСтрокаРеклассификация.СчетЗатрат;
			лДвижение.СтатьяЗатрат = лСтатьяЗатрат;
			лДвижение.НоменклатурнаяГруппа = лНоменклатурнаяГруппа;
			лДвижение.Заказ = Неопределено;
			лДвижение.Сумма = -ТекСтрокаРеклассификация.СуммаЗатрат; 
			лДвижение.СписаниеПартий = Ложь;
			лДвижение.КодОперации = Перечисления.КодыОперацийНезавершенноеПроизводство.ПустаяСсылка();
		КонецЕсли;
		// is ЯннуровВФ кон 20140611
		
		ПроводкаМСФО = Движения.Международный.Добавить();
		ПроводкаМСФО.Период = Дата;
		ПроводкаМСФО.СчетДт = ТекСтрокаРеклассификация.СчетЗатрат;
		ПроводкаМСФО.СчетКт = ТекСтрокаРеклассификация.СчетВзаиморасчетов;
		ПроводкаМСФО.Организация = Организация;
		ПроводкаМСФО.Сумма = -ТекСтрокаРеклассификация.СуммаЗатрат;
		ПроводкаМСФО.Содержание = "Реклассификация расходов";
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетДт, ПроводкаМСФО.СубконтоДт, 1, ТекСтрокаРеклассификация.СубконтоЗатрат1);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетДт, ПроводкаМСФО.СубконтоДт, 2, ТекСтрокаРеклассификация.СубконтоЗатрат2);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетДт, ПроводкаМСФО.СубконтоДт, 3, ТекСтрокаРеклассификация.СубконтоЗатрат3);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 1, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов1);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 2, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов2);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 3, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов3);
		// is ЯннуровВФ нач 20140623 0И-001232
		Если ТекСтрокаРеклассификация.СчетВзаиморасчетов.Валютный Тогда 
			ПроводкаМСФО.ВалютаКт = ТекСтрокаРеклассификация.ис_ВалютаВзаиморасчетов;
			ПроводкаМСФО.ВалютнаяСуммаКт = ТекСтрокаРеклассификация.ис_ВалютнаяСуммаВзаиморасчетов;
		КонецЕсли;
		// is ЯннуровВФ кон 20140623
        		
		// is ЯннуровВФ нач 20140602 ЗР-0И-001232 Раскомментировал
		//начало изменений ДС МСФО 09.01.2014
		ПроводкаМСФО = Движения.Международный.Добавить();
		ПроводкаМСФО.Период = Дата;
		ПроводкаМСФО.СчетДт = ТекСтрокаРеклассификация.СчетУчетаОС;
		ПроводкаМСФО.СчетКт = ТекСтрокаРеклассификация.СчетВзаиморасчетов;
		ПроводкаМСФО.Организация = Организация;
		ПроводкаМСФО.Сумма = ТекСтрокаРеклассификация.СуммаЗатрат;
		ПроводкаМСФО.Содержание = "Реклассификация расходов";
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетДт, ПроводкаМСФО.СубконтоДт, 1, ТекСтрокаРеклассификация.ОсновноеСредство);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 1, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов1);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 2, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов2);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаМСФО.СчетКт, ПроводкаМСФО.СубконтоКт, 3, ТекСтрокаРеклассификация.СубконтоВзаиморасчетов3);
		//конец изменений ДС МСФО 09.01.2014
		// is ЯннуровВФ кон 20140602
		// is ЯннуровВФ нач 20140623 0И-001232
		Если ТекСтрокаРеклассификация.СчетВзаиморасчетов.Валютный Тогда 
			ПроводкаМСФО.ВалютаКт = ТекСтрокаРеклассификация.ис_ВалютаВзаиморасчетов;
			ПроводкаМСФО.ВалютнаяСуммаКт = ТекСтрокаРеклассификация.ис_ВалютнаяСуммаВзаиморасчетов;
		КонецЕсли;
		// is ЯннуровВФ кон 20140623
	КонецЦикла;
	
	// is ЯннуровВФ нач 20140523 ЗР-0И-001232
	Движения.Международный.Записать();
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДС_РекласификацияРасходовОСМСФОРеклассификация.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ДС_РекласификацияРасходовОСМСФО.Реклассификация КАК ДС_РекласификацияРасходовОСМСФОРеклассификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Международный.Остатки(
	|				,
	|				Счет В (&Счета),
	|				,
	|				(Субконто1, Субконто2, Субконто3) В
	|					(ВЫБРАТЬ
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов1,
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов2,
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов3
	|					ИЗ
	|						Документ.ДС_РекласификацияРасходовОСМСФО.Реклассификация КАК ДС_РекласификацияРасходовОСМСФОРеклассификация
	|					ГДЕ
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.Ссылка = &Ссылка)) КАК МеждународныйОстатки
	|		ПО ДС_РекласификацияРасходовОСМСФОРеклассификация.СчетВзаиморасчетов = МеждународныйОстатки.Счет
	|			И ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов1 = МеждународныйОстатки.Субконто1
	|			И ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов2 = МеждународныйОстатки.Субконто2
	|			И ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоВзаиморасчетов3 = МеждународныйОстатки.Субконто3
	|ГДЕ
	|	ДС_РекласификацияРасходовОСМСФОРеклассификация.Ссылка = &Ссылка
	|	И МеждународныйОстатки.СуммаОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство
	|АВТОУПОРЯДОЧИВАНИЕ";
	лЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	лЗапрос.УстановитьПараметр("Счета", Реклассификация.ВыгрузитьКолонку("СчетВзаиморасчетов"));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Отказ = Истина;
		Сообщить("Актив """+лВыборка.ОсновноеСредство+""" имеет отрицательный остаток на счете взаиморасчетов");
	КонецЦикла;
	// is ЯннуровВФ кон 20140523
	
	// is ЯннуровВФ нач 20140610 ЗР-0И-001232
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДС_РекласификацияРасходовОСМСФОРеклассификация.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ДС_РекласификацияРасходовОСМСФО.Реклассификация КАК ДС_РекласификацияРасходовОСМСФОРеклассификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Международный.Остатки(
	|				,
	|				Счет В (&Счета),
	|				,
	|				(Субконто1, Субконто2) В
	|					(ВЫБРАТЬ
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоЗатрат1,
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоЗатрат2
	|					ИЗ
	|						Документ.ДС_РекласификацияРасходовОСМСФО.Реклассификация КАК ДС_РекласификацияРасходовОСМСФОРеклассификация
	|					ГДЕ
	|						ДС_РекласификацияРасходовОСМСФОРеклассификация.Ссылка = &Ссылка)) КАК МеждународныйОстатки
	|		ПО ДС_РекласификацияРасходовОСМСФОРеклассификация.СчетЗатрат = МеждународныйОстатки.Счет
	|			И ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоЗатрат1 = МеждународныйОстатки.Субконто1
	|			И ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоЗатрат2 = МеждународныйОстатки.Субконто2
	|			И (ДС_РекласификацияРасходовОСМСФОРеклассификация.СубконтоЗатрат3 = МеждународныйОстатки.Субконто3
	|				ИЛИ МеждународныйОстатки.Счет.ВидыСубконто.НомерСтроки = 3
	|					И МеждународныйОстатки.Счет.ВидыСубконто.ТолькоОбороты = ИСТИНА)
	|ГДЕ
	|	ДС_РекласификацияРасходовОСМСФОРеклассификация.Ссылка = &Ссылка
	|	И МеждународныйОстатки.СуммаОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство
	|АВТОУПОРЯДОЧИВАНИЕ";
	лЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	лЗапрос.УстановитьПараметр("Счета", Реклассификация.ВыгрузитьКолонку("СчетЗатрат"));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Отказ = Истина;
		Сообщить("Актив """+лВыборка.ОсновноеСредство+""" имеет отрицательный остаток на счете затрат");
	КонецЦикла;
	// is ЯннуровВФ кон 20140610
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//начало изменений ДС МСФО 11.12.2013
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	//конец изменений ДС МСФО 11.12.2013
КонецПроцедуры //ОбработкаЗаполнения()
